
//part 1 || - Є змінна х, якій ви надаєте довільне числове значення.
// Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let x = prompt('Write number');
//
// if(x!=0&&!isNaN(x)){
// console.log("Вірно");
// }
// else if(x==0&&!isNaN(x)){
//     console.log("Не вірно");
// }
// else {
//     console.log("Не число");
// }

//part 2 ||- Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

// let time = prompt('Введіть число від 0 до 59');
//
// if(time>=0&&time<=15){
//     console.log('Число припадає до першої четверті');
// }
// else if(time>15&&time<=30){
//     console.log('Число припадає до другої четверті');
// }
// else if(time>30&&time<=45){
//     console.log('Число припадає до третьої четверті');
// }
// else if(time>45&&time<60){
//     console.log('Число припадає до четвертої четверті');
// }
// else {
//     console.log("Ви не ввели число від 0 до 59");
// }

//part 3 || - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
//P.s Половини бувають тільки дві :D

// let day = prompt("Введіть день місяця");
//
// if(day>0&&day<11){
//     console.log("Цей день попадає у першу частину місяця");
// }else if(day>10&&day<21){
//     console.log("Цей день попадає у другу частину місяця");
// }else if(day>20&&day<31){
//     console.log("Цей день попадає у третю частину місяця");
// }else if(day>30||day<1){
//     console.log("Ви ввели завелике або замале значення");
// }else {
//     console.log("Це не число");
// }

//part 4 || - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).

// let day = prompt("Введіть порядковий номер тижня");
//
// switch (day){
//     case '1':
//         document.write("Пробіжка");
//         break;
//     case '2':
//         document.write("Навчання");
//         break;
//     case '3':
//         document.write("Розваги");
//         break;
//     case '4':
//         document.write("Спорт");
//         break;
//     case '5':
//         document.write("Пянка");
//         break;
//     case '6':
//         document.write("Бійка");
//         break;
//     case '7':
//         document.write("Відпочинок");
//         break;
//     default: document.write("Ви не ввели порядковий номер тижня!!!")
// }

//part 5 || - Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.

// let x = prompt("Введіть перше число");
// let y = prompt("Введіть друге число");
//
// if (!isNaN(x)&&!isNaN(y)) {
//     if (x > y) {
//         console.log("Максимальне число: " + x);
//     } else if (x < y) {
//         console.log("Максимальне число: " + y);
//     } else if (x === y) {
//         console.log("Числа рівні!");
//     }
// }else {
//     console.log("Ви не ввели два числа...");
// }

//part 6 || - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
// за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)

// let x = +prompt("Введіть Щось")|| console.log('default');
